[
  {
    "headline": "Israel kills 18 in Gaza as Hamas urges pressure on Netanyahu for ceasefire",
    "link": "https://www.aljazeera.com/news/liveblog/2024/9/5/israels-war-on-gaza-live-thousands-flee-jenin-homes-at-gunpoint",
    "slug": "israelkills",
    "body": "<br><br><ul><li><a href='https://www.aljazeera.com/news/liveblog/2024/9/5/israels-war-on-gaza-live-thousands-flee-jenin-homes-at-gunpoint'>Visit Al Jazeera</a></li></ul>",
    "summary": "Hamas says Netanyahu is thwarting a ceasefire deal by refusing to withdraw forces from Gaza’s Philadelphi Corridor.",
    "author": "Zaheena Rasheed",
    "media": "https://www.aljazeera.com/wp-content/uploads/2024/09/AA-20240904-35561793-35561784-FUNERAL_HELD_FOR_A_PALESTINIAN_WHO_WAS_KILLED_IN_AN_ISRAELI_ATTACK-1725487373.jpg?resize=730%2C410&quality=80",
    "date": "2024-09-05T04:00:00.000Z",
    "resource": "Al Jazeera",
    "id": "cm0ou56x90000ldt72kufaown"
  },
  {
    "headline": "New Zealand’s young leaving in record numbers as cost of living bites",
    "link": "https://www.aljazeera.com/economy/2024/9/5/new-zealands-young-are-departing-in-record-numbers-as-cost-of-living-bites",
    "slug": "newzealandsyoung",
    "body": "<p>Wellington, New Zealand – When Jessica Chong started sending out invitations for a recent party to celebrate her and her partner’s birthdays in Auckland, New Zealand, she realised that few of their closest friends would be able to attend.</p><p>In the last few months, most of them had moved overseas.</p><p>Chong’s experience reflects a broader trend.</p><p>Despite its international image as a progressive haven, New Zealand is experiencing a record exodus of people amid steep rises in living costs, a scarcity of jobs and what Chong calls a generally “grim” atmosphere.</p><p>“It just feels a bit empty,” Chong, 28, who is herself planning to move to London, told Al Jazeera.</p><p>“It will actually be kind of funny: we’ll move there and be hanging out with people we already know, which is not the point but will be kind of nice.”</p><figure><img src=\"https://www.aljazeera.com/wp-content/uploads/2024/09/DJ-Wedding-117_Original-1725456544.jpg?w=427&resize=427%2C640&quality=80\" alt=\"Jessica Chong\"/><figcaption>Jessica Chong</figcaption></figure><p>According to provisional figures from Statistics New Zealand, 131,200 people left New Zealand in the year to June 2024, the highest number on record.</p><p>Of those, 80,200 were citizens, roughly double the number of annual departures before the COVID-19 pandemic. Nearly 40 percent of those leaving were aged between 18 and 30.</p><p>With outward migration at unprecedented levels, experts fear that many of those leaving may not come back.</p><p>“It’s off the charts. We haven’t seen this number of New Zealanders leaving before,” Brad Olsen, principal economist at Wellington-based consultancy firm Infometrics, told Al Jazeera.</p><p>New Zealand, one of the world’s most isolated and least populous countries, has a long tradition of its citizens temporarily moving abroad for what locals call “overseas experiences”, most often to the United Kingdom or Australia.</p><p>Apart from the 5.2 million New Zealanders resident in the country, an estimated one million citizens live overseas.</p><p>When the pandemic hit, more than 50,000 New Zealanders rushed back home, where strict lockdowns and border controls kept the country largely COVID-free for more than a year, winning it plaudits abroad.</p><p>In recent years, though, New Zealand has struggled economically.</p><p>In June, the economy returned to growth after twin recessions in the span of 18 months, posting a modest 0.2 percent quarterly expansion.</p><p>Unemployment grew to 4.6 percent in the June quarter, up from 3.6 percent during the same period in 2023.Wage growth, though ahead of inflation, slowed to 4.1 percent, down from 4.3 percent the previous year.</p><p>For many young New Zealanders, home ownership feels ever out of reach.</p><p>After several years of declines, house prices are once again rising and remain roughly seven times higher than the average income, according to Infometrics figures.</p><p>Overall inflation peaked in 2022 at 7.3 percent, one of the highest rates in the developed world, and remains well above the central bank’s target at 3.3 percent.</p><p>As a result, the Reserve Bank of New Zealand rolled out successive hikes in the benchmark interest rate, which peaked at 5.5 percent.</p><figure><img src=\"https://www.aljazeera.com/wp-content/uploads/2024/09/GettyImages-1542345055-1725348391.jpg?w=770&resize=770%2C506&quality=80\" alt=\"aukland \"/><figcaption>aukland </figcaption></figure><p>“It’s the right medicine, but it makes the economic climate feel very difficult for people,” Olsen said.</p><p>Driven by discontent over the economy, voters in October replaced the progressive Labour-led government with a cost-cutting conservation coalition led by the National Party, headed by former airline executive Christopher Luxon.</p><p>After the Reserve Bank of New Zealand last month announced a 0.25 percent interest rate cut, Minister of Finance Nicola Willis expressed hope that the economy was “back on track” after years of spiralling prices.</p><p>“New Zealand has been suffering an acute cost-of-living crisis since the middle of 2021, with weekly food budgets stretched thin, mortgage repayments high and confidence in our living rooms, offices and boardrooms low,” Willis said.</p><p>For many, though, signs of a turnaround are coming too late.</p><p>More than anywhere elsewhere, those who feel disillusioned are turning to their closest neighbour.</p><p>In 2023 alone, 44,500 New Zealanders relocated to Australia, according to Statistics New Zealand.</p><p>The scale of the outflow is particularly concerning to economists like Olsen, who believes it signals that many New Zealanders are making a more permanent shift than the normal “overseas experience”.</p><p>“It does highlight that there are wider moves afoot. Part of that is a view that the grass is greener across the ditch,” Olsen said.</p><p>That is driving “the biggest exodus we’ve ever seen”, he added.</p><p>Michaela Young, 27, is among those who have made the move across the Tasman Sea.</p><p>After graduating from the Victoria University of Wellington with a master’s degree in biomedicine, Young struggled to find jobs in her industry that paid enough for her to get by.</p><p>“The cost of living was a huge deal, and it was definitely becoming more rampant,” Young told Al Jazeera. Groceries “were a bit crazy”, she added.</p><figure><img src=\"https://www.aljazeera.com/wp-content/uploads/2024/09/AFP__20211130__9TM7QY__v1__HighRes__AustraliaNzealandPoliticsLuxon-1725349187.jpg?w=770&resize=770%2C513&quality=80\" alt=\"Luxon\"/><figcaption>Luxon</figcaption></figure><p>In an analysis earlier this year, World Vision found that the cost of basic food items in New Zealand had jumped by 56 percent between 2022 and 2023. Young said she was particularly struck by the price changes when she saw a bag of marshmallows on sale at a supermarket for 8 New Zealand dollars ($4.99).</p><p>In March, Young moved to Melbourne, following the lead of several friends and former housemates.</p><p>In Australia’s second largest city, she found herself surrounded by other New Zealanders.</p><p>Every Tuesday, she and her friends gather at a local pub for drinks and a quiz. They often find themselves hampered by their lack of an Australian teammate but are occasionally able to win pity from the quiz master, who is also a New Zealander.</p><p>While Chong and Young both say they eventually expect to return to New Zealand, Olsen fears that old assumptions about reverse migration may no longer hold true.</p><p>Many New Zealanders who move abroad have traditionally returned home after a few years to be close to family, he said.</p><p>“But if you haven’t got a job and you haven’t got an affordable house, then you really start to ask the question: Are you better to come back to New Zealand, or are mum and dad better to move wherever you are in the world?”</p><p>Bigger outflows combined with weaker pull factors are when “we really start to risk population and innovation into the future”, Olsen said.</p><p>Now, he said, people are leaving in such large numbers that he is seeing the effects in his own circles.“You seem to either have leaving parties or invitations to farewell brunches every week,” he said.</p><br><br><ul><li><a href='https://www.aljazeera.com/economy/2024/9/5/new-zealands-young-are-departing-in-record-numbers-as-cost-of-living-bites'>Visit Al Jazeera</a></li></ul>",
    "summary": "New Zealanders are seeking opportunity overseas at unprecedented rates amid disillusionment over house prices and jobs.",
    "author": "Pete McKenzie",
    "media": "https://www.aljazeera.com/wp-content/uploads/2024/09/GettyImages-1783069848-1725348398.jpg?resize=770%2C513&quality=80",
    "date": "2024-09-05T04:00:00.000Z",
    "resource": "Al Jazeera",
    "id": "cm0ou57pp0001ldt72oqe873o"
  },
  {
    "headline": "Russia-Ukraine war: List of key events, day 923",
    "link": "https://www.aljazeera.com/news/2024/9/5/russia-ukraine-war-list-of-key-events-day-923",
    "slug": "russiaukrainewarlist",
    "body": "<p>Here is the situation on Thursday, September 5, 2024.</p><h2>Fighting</h2><p>Ukraine’s air force said it had shot down seven out of 13 missiles and 22 out of 29 drones that Russia deployed in an attack on energy facilities and critical infrastructure in nine Ukrainian regions.</p><p></p><p></p><p></p><h2>Politics and diplomacy</h2><figure><img src=\"https://www.aljazeera.com/wp-content/uploads/2024/09/AP24248252073086-1725495508.jpg?w=770&resize=770%2C433&quality=80\" alt=\"Smoke and dust rising from a building left in ruins by the Russian attack. The photo is taken from above.\"/><figcaption>Smoke and dust rising from a building left in ruins by the Russian attack. The photo is taken from above.</figcaption></figure><br><br><ul><li><a href='https://www.aljazeera.com/news/2024/9/5/russia-ukraine-war-list-of-key-events-day-923'>Visit Al Jazeera</a></li></ul>",
    "summary": "As the war enters its 923rd day, these are the main developments.",
    "author": "See article for details",
    "media": "https://www.aljazeera.com/wp-content/uploads/2024/09/AFP__20240904__36FH8CZ__v5__HighRes__TopshotUkraineRussiaConflictWar-1725495200.jpg?resize=770%2C513&quality=80",
    "date": "2024-09-05T04:00:00.000Z",
    "resource": "Al Jazeera",
    "id": "cm0ou57xq0002ldt7356dh03m"
  },
  {
    "headline": "Malaysia probing leak of classified Chinese note over South China Sea",
    "link": "https://www.aljazeera.com/news/2024/9/5/malaysia-probing-leak-of-classified-chinese-note-over-south-china-sea",
    "slug": "malaysiaprobingleak",
    "body": "<p>Malaysia’s Ministry of Foreign Affairs has said it is investigating the leak of a classified document China sent to its embassy in Beijing in February following the publication last month of an article in a Philippine media outlet.</p><p>The ministry said police would be informed and an internal investigation was under way, in a statement released late on Wednesday.</p><p></p><p></p><p></p><p></p><p>It did not name the outlet or confirm the authenticity of the note’s contents but did go into detail about Malaysia’s claims in the disputed South China Sea.</p><p>The Philippine Daily Inquirer reported on August 29 that China had sent the Malaysian embassy a diplomatic note to stop all oil exploration and drilling activities at Luconia Shoals, which lie about 100 kilometres off the Malaysian state of Sarawak.</p><p>Quoting the note, the paper reported China claiming Malaysia’s activities “infringed” on its sovereignty.</p><p>The shoals are some 1,300km from Hainan Island, China’s nearest major landmass.</p><p>“The ministry views the leak of this document, which constitutes an official communication channel between the two countries, with grave concern,” the statement said.</p><p>Beijing claims almost the entire South China Sea under a nine-dash line that was ruled without merit in 2016 by an international court.</p><p>Malaysia, the Philippines, Vietnam and Taiwan also claim parts of the waterway.</p><p>Tensions have soared in recent months with repeated confrontations between Chinese and Philippine coastguard vessels at Second Thomas Shoal and other disputed areas.</p><p>Malaysia’s Foreign Ministry noted that Beijing and Kuala Lumpur had committed to resolving the South China Sea dispute peacefully.</p><p>“Malaysia’s stance on the South China Sea remains unchanged,” the statement said. “Malaysia will continue to defend its sovereignty, sovereign rights and interests in its maritime areas … This approach aligns with the universally recognised principles of international law, including the United Nations Convention on the Law of the Sea [UNCLOS], 1982.”</p><p>China’s embassy in Kuala Lumpur did not respond to phone and emailed requests for comment.</p><br><br><ul><li><a href='https://www.aljazeera.com/news/2024/9/5/malaysia-probing-leak-of-classified-chinese-note-over-south-china-sea'>Visit Al Jazeera</a></li></ul>",
    "summary": "Move follows publication of leaked document warning Malaysia off oil drilling by Philippine media outlet.",
    "author": "See article for details",
    "media": "https://www.aljazeera.com/wp-content/uploads/2024/09/AP24171115877407-1725501645.jpg?resize=770%2C513&quality=80",
    "date": "2024-09-05T04:00:00.000Z",
    "resource": "Al Jazeera",
    "id": "cm0ou58f20003ldt78v7003nx"
  },
  {
    "headline": "Ukraine’s losses outweigh Kursk gains, as Russia on cusp of taking Pokrovsk",
    "link": "https://www.aljazeera.com/features/2024/9/4/ukraines-losses-outweigh-kursk-gains-as-russia-on-cusp-of-taking-key-town",
    "slug": "ukraineslossesoutweigh",
    "body": "<p>Kyiv, Ukraine – Svitlana Menyaylo doesn’t want to hear a word about the success of Ukrainian forces in the western Russian region of Kursk.</p><p>Since August 6, Ukrainian soldiers have occupied dozens of Russian villages on more than 1,000 square kilometres (620 square miles) and are digging in to repel an imminent Russian counteroffensive.</p><p></p><p></p><p></p><p></p><p>But for Menyaylo, a seamstress from the besieged town of Pokrovsk in the eastern Ukrainian region of Donetsk, the very presence of Ukrainian troops in Kursk feels like treason.</p><p>Pokrovsk, the administrative centre of a heavily industrialised agglomeration with a pre-war population of almost 400,000, is likely to be taken over by advancing Russian troops soon.</p><p>They are less than 10km (6 miles) east of it – and keep inching in every minute after months of heavy bombardment and “meat marches”, frontal attacks on Ukrainian positions that have cost Russian generals tens of thousands of servicemen.</p><p>The depopulated town and several highways and railways it straddles have served as a crucial logistical hub for the Ukrainian military, and their takeover may burst the front line open and become a propaganda triumph for the Kremlin.</p><p>The government in Kyiv “should have sent those troops [from Kursk] here to repel the orcs”, Menyaylo told Al Jazeera in a telephone interview using a derogatory term for Russian servicemen.</p><p>As many in Ukraine cheered the military incursion into Kursk that caught Moscow by surprise, tens of thousands in Donetsk get ready to flee. Meanwhile, Russia’s aerial attacks on other parts of the country continue uninterrupted: at least 51 people were killed in missile strikes on central Ukraine’s Poltava on Tuesday.</p><p>“So what with the Kursk region? We’re running out of Donetsk,” Menyaylo said, repeating a tragic meme circulating online in recent days.</p><figure><img src=\"https://www.aljazeera.com/wp-content/uploads/2024/09/AP24236582953502-1725431519.jpg?w=770&resize=770%2C513&quality=80\" alt=\"A father hugs his daughter, his other children nearby, as they wait for evacuation in Pokrovsk, Donetsk region, Ukraine, Friday, Aug. 23, 2024. (AP Photo/Evgeniy Maloletka)\"/><figcaption>A father hugs his daughter, his other children nearby, as they wait for evacuation in Pokrovsk, Donetsk region, Ukraine, Friday, Aug. 23, 2024. (AP Photo/Evgeniy Maloletka)</figcaption></figure><h2>‘They live in two realities’</h2><p>At the time of the interview, the 42-year-old was about to leave her two-bedroom apartment amid the whooshing of Russian shelling and the thuds of heavy gliding bombs that collapsed several buildings nearby.</p><p>She said she was packing bags with clothes, documents and mementoes, such as photos of her grandparents who moved to Donetsk from central Ukraine after World War II.</p><p>She blames the loss of her home on President Volodymyr Zelenskyy’s government and top brass — some of whom were fired by him on Tuesday in a major reshuffle.</p><p>“It’s like they live in two realities, they care about those ephemeral gains instead of defending Ukrainian land here and now,” she said.</p><p>Military analysts agree.</p><p>“Yes, the two campaigns are developing in parallel realities, and despite a small success in Kursk in the past two weeks, further goals are not quite understandable,” Nikolay Mitrokhin, a researcher with Germany’s Bremen University, told Al Jazeera.</p><p>Russia moved only small numbers of troops from the Ukrainian front line to Kursk, augmenting them with barely-trained conscripts and ethnic Chechen servicemen with dubious battlefield experience.</p><p>But Kyiv dispatched thousands of servicemen to Kursk, leaving its forces in Donetsk with skeleton crews that cannot contain a “front-line breach”, Mitrokhin said.</p><p>The Kremlin boosted its advance on Pokrovsk by deploying troops that had been storming the nearby town of Chasiv Yar, and their breakthrough in Donetsk means they would be able to strike Ukrainian forces in the nearby Zaporizhia region.</p><p>Moscow seized three-fourths of Zaporizhia in 2022, and Ukrainian forces liberated tiny areas during their failed counteroffensive last year.</p><p>“In the coming two weeks, Ukraine is very likely to lose almost all of its front line in Zaporizhia if it doesn’t deploy all of its reserves from somewhere or doesn’t start a new advance” on Russian territory, Mitrokhin said.</p><figure><img src=\"https://www.aljazeera.com/wp-content/uploads/2024/09/AP24236582812906-1725431575.jpg?w=770&resize=770%2C513&quality=80\" alt=\"People line up to register for evacuation in Pokrovsk, Donetsk region, Ukraine, Friday, Aug. 23, 2024. (AP Photo/Evgeniy Maloletka)\"/><figcaption>People line up to register for evacuation in Pokrovsk, Donetsk region, Ukraine, Friday, Aug. 23, 2024. (AP Photo/Evgeniy Maloletka)</figcaption></figure><h2>‘Slippery’ slope</h2><p>But Ukraine seems to have run out of reserves amid more losses in the southern Kherson region.</p><p>Most of Kherson has been occupied since 2022, and Kyiv kept trying to regain ground there by seizing small islands in the delta of the Dnipro despite heavy losses.</p><p>In recent weeks, Ukrainian troops abandoned most of the islands, and undermanned air defence forces cannot contain Russian drone attacks that “over-terrorised” the regional capital, also named Kherson, Mitrokhin said.</p><p>“In general, Ukraine’s positions in August have deteriorated rapidly,” he concluded.</p><p>The situation is so bad that some Ukrainian observers simply refuse to comment on it.</p><p>“The topic is slippery, I don’t want to breed treason,” one military expert told Al Jazeera.</p><p>Meanwhile, Ukrainian officials insist that the impending loss of Pokrovsk will not result in Moscow’s strategic victory as Russia is about to run out of manpower, weapons and ammunition.</p><p>“The enemy is now throwing all their forces and means to break through there. And if they’re stopped now, they don’t have large resources to act in other directions,” Roman Kostenko, head of the parliamentary committee on national security, defence and intelligence, said in televised remarks.</p><p>Still, the end of summer brought more depressing news for Kyiv.</p><p>In July, Ukraine received 10 F-16 fighter jets – and lost one of them last week.</p><p>Lawmaker Mariana Bezugla claimed it had been shot down by friendly fire from the Patriot air defence system during a massive Russian drone attack. Officials denied the claim, but Zelenskyy fired air force head Mykola Oleshchuk.</p><p>Not all is gloomy on the front line, however, with Ukraine striking Russian airfields, fuel depots, military plants and infrastructure sites in drone attacks.</p><p>The largest such attack took place on Saturday night and involved 158 drones that reached 16 western Russian regions, according to the Russian Ministry of Defence.</p><p>The drones hit an oil refinery outside Moscow and one of Russia’s largest thermal power plants in the Volga River town of Konakovo more than 800km (500 miles) north of the Ukrainian border.</p><p>Russian officials claimed that five Ukrainian drones had been shot down without harming the plant. But witnesses, photos and video evidence suggest that the plant was seriously damaged.</p><p>“My whole house was shaking, and the fire spread to half of the sky,” a Konakovo resident told Al Jazeera on condition of anonymity. “And the noise of the fire was so loud that one couldn’t talk.”</p><br><br><ul><li><a href='https://www.aljazeera.com/features/2024/9/4/ukraines-losses-outweigh-kursk-gains-as-russia-on-cusp-of-taking-key-town'>Visit Al Jazeera</a></li></ul>",
    "summary": "Ukraine’s diversion of troops for the Kursk attack has left parts of Donetsk vulnerable, say analysts. And Pokrovsk could fall soon to Russia.",
    "author": "Mansur Mirovalev",
    "media": "https://www.aljazeera.com/wp-content/uploads/2024/09/AP24236583202378-1725431416.jpg?resize=770%2C513&quality=80",
    "date": "2024-09-04T04:00:00.000Z",
    "resource": "Al Jazeera",
    "id": "cm0ou59xu0004ldt78qi69lw4"
  },
  {
    "headline": "Netanyahu doubles down on military control over Gaza’s Philadelphi Corridor",
    "link": "https://www.aljazeera.com/news/2024/9/5/netanyahu-doubles-down-on-military-control-over-gazas-philadelphi-corridor",
    "slug": "netanyahudoublesdown",
    "body": "<p>Israel’s Prime Minister Benjamin Netanyahu said his military must retain open-ended control over Gaza’s southern border area with Egypt – known as the Philadelphi Corridor – digging in on a position that threatens to derail ceasefire efforts.</p><p>Netanyahu’s stance on the corridor – which was seized by Israeli forces in May – has become the key obstacle to reaching a ceasefire deal in Gaza as pressure mounts on the Israeli leader amid mass protests domestically demanding that a deal be reached that brings captives home and international outrage as the number of Palestinians confirmed killed by Israel’s military in Gaza nears 41,000.</p><p></p><p></p><p></p><p></p><p>“Gaza must be demilitarised, and this can only happen if the Philadelphi Corridor remains under firm control,” Netanyahu told foreign journalists on Wednesday.</p><p>Netanyahu said Israel must maintain control of the corridor to prevent weapons being smuggled into Gaza and that Israel would only consider withdrawing from the strategic location when presented with an alternative plan to police the area.</p><p>“Bring me anyone who will actually show us … that they can actually prevent the recurrence” of smuggling, he said. “I don’t see that happening right now. And until that happens, we’re there.”</p><p></p><p></p><p></p><p>When asked by journalists for a timeline for Israel ending its war on Gaza, Netanyahu refused to give one.</p><p>“How long can we do this? As long as it takes to achieve this victory. And I think we’re getting a lot closer,” he said.</p><p>Netanyahu has faced searing criticism from many in Israel for his position on the Philadelphi Corridor, including from within his own military and security establishment who believe Israeli troops do not need to be permanently based in Gaza and could, instead, launch targeted raids if required to stop arms smuggling.</p><p>Egypt, a mediator in the ceasefire talks along with the US and Qatar, has also demanded a concrete timeline for Israel’s withdrawal from the corridor which runs along its border. The United Arab Emirates, which established formal ties with Israel in the 2020 Abraham Accords – designed to normalise Arab-Israeli relations – has also criticised Israel’s decision to control the corridor on Wednesday.</p><p>In a statement released on Thursday, Hamas blamed Netanyahu for the ongoing impasse in ceasefire talks and accused the Israeli leader of wanting to prolong the war on Gaza.</p><p>“Netanyahu’s decision not to withdraw from the Salah al-Din [Philadelphi Corridor] axis aims to thwart reaching an agreement,” Hamas said in the statement.</p><p></p><p></p><p></p><p>“We warn against falling into Netanyahu’s trap and tricks, as he uses negotiations to prolong the aggression against our people,” Hamas said, adding that Israel must be held to a deal that was agreed earlier this year.</p><p>“We do not need new proposals. What is required now is to pressure Netanyahu and his government and oblige them to what has been agreed upon,” the statement reads.</p><p>During his address to reporters on Wednesday, Netanyahu also incorrectly claimed that Israel’s ground invasion of Rafah in southern Gaza in May forced the first release of Israeli captives held by Hamas in Gaza.</p><p>That negotiated release, in fact, took place months earlier in November under a weeklong ceasefire deal agreed between Israel and Hamas.</p><p>The Israel-Hamas truce began on November 24 and was renewed twice.</p><p>Under the agreement, fighting was paused and humanitarian aid was allowed to enter Gaza as Hamas released captives in exchange for Israel releasing Palestinian prisoners.</p><p>By the end of the six-day truce on November 30, 105 captives had been released by Hamas and 240 Palestinian prisoners had been freed by Israel.</p><p></p><p></p><p></p><br><br><ul><li><a href='https://www.aljazeera.com/news/2024/9/5/netanyahu-doubles-down-on-military-control-over-gazas-philadelphi-corridor'>Visit Al Jazeera</a></li></ul>",
    "summary": "Hamas calls for pressure on Netanyahu to stick to agreed ceasefire plan, accuses the Israeli leader of using the Philadelphi Corridor to thwart deal.",
    "author": "See article for details",
    "media": "https://www.aljazeera.com/wp-content/uploads/2024/09/AP24196382360129-1725502650.jpg?resize=770%2C513&quality=80",
    "date": "2024-09-05T04:00:00.000Z",
    "resource": "Al Jazeera",
    "id": "cm0ou5afg0005ldt71pspde5e"
  },
  {
    "headline": "Poland scrambles planes as Russia strikes western Ukraine",
    "link": "https://www.aljazeera.com/news/2024/9/4/poland-scrambles-planes-as-russia-strikes-western-ukraine",
    "slug": "polandscramblesplanes",
    "body": "<p>NATO-member Poland has scrambled aircraft as Russia launched air strikes on Ukraine‘s western city of Lviv close to its border.</p><p>Polish and “allied” aircraft were scrambled overnight on Tuesday as Russia launched a major attack on Lviv, according to Reuters news agency. It was the third time in eight days that the NATO member’s defences had been activated since Russia stepped up its bombardment across Ukraine.</p><p></p><p></p><p></p><p></p><p>At least seven people are reported to have been killed in Lviv, with many more injured in drone and missile attacks that saw historic buildings destroyed in the heart of the city, according to regional officials.</p><p>Andriy Sadovyi, the mayor of Lviv city, said three children were among the dead.</p><p>In a video posted on the Telegram messaging app that showed the mayor among the debris of a destroyed building, he said more than 50 structures, from schools to homes and clinics, most of them in the heart of the city, had been damaged.</p><p>The operational command of Poland’s armed forces said on X platform that “Polish and allied aircraft” had been scrambled due to the Russian attack in western Ukraine.</p><p>“This is another very busy night for the entire air defence system,” the post read.</p><p></p><p></p><p></p><p>Russia also hit Kyiv and several other regions with missiles on Wednesday morning, but no immediate damage was reported.</p><p>Moscow has been pounding Ukraine with hundreds of missiles and drones over the past two weeks. Russian military bloggers claim that the step up in air strikes is a response to Kyiv’s incursion into its territory in Kursk.</p><p>The deadliest single attack this year was seen on Tuesday, as a military institute in the central town of Poltava was hit. The strike, by a pair of ballistic missiles, killed more than 50 and wounded hundreds.</p><p>Russia has yet to comment on the attack on Poltava or Wednesday’s strikes on Lviv and Kyiv. It has long insisted that its strikes only aim at military, energy and transport infrastructure targets, not civilians.</p><h2>Poland beefing up defence</h2><p>On Tuesday, Warsaw announced new military deals worth $520m, the latest move in a drive to beef up its defence prompted by Russia’s invasion of Ukraine in 2022.</p><p>Poland currently spends 4 percent of its gross domestic product (GDP) on defence – the highest ratio of any NATO member – and hopes to boost the number to 4.7 percent next year.</p><p>Last month, Warsaw signed a $10bn deal to buy 96 Apache attack helicopters from US manufacturer Boeing. They will replace outdated Russian Mi-24 helicopters.</p><p>Warsaw has also announced a deal to buy hundreds of AIM-120C AMRAAM air-to-air missiles, as well as a contract for 48 launchers for US-designed Patriot air defence systems.</p><p>Poland’s army has 200,000 soldiers, making it NATO’s third largest after the United States and Turkey, and the biggest in the European Union.</p><br><br><ul><li><a href='https://www.aljazeera.com/news/2024/9/4/poland-scrambles-planes-as-russia-strikes-western-ukraine'>Visit Al Jazeera</a></li></ul>",
    "summary": "Missile and drone attack on Lviv, close to border with the NATO member, kills at least seven people.",
    "author": "See article for details",
    "media": "https://www.aljazeera.com/wp-content/uploads/2024/09/2023-08-15T141343Z_1872762231_RC2EO2AE575J_RTRMADP_3_POLAND-MILITARY-1725432563.jpg?resize=770%2C513&quality=80",
    "date": "2024-09-04T04:00:00.000Z",
    "resource": "Al Jazeera",
    "id": "cm0ou5at10006ldt7292o274o"
  },
  {
    "headline": "Trump, Harris agree on debate rules after dispute over muted microphones",
    "link": "https://www.aljazeera.com/news/2024/9/5/trump-harris-agree-on-debate-rules-after-dispute-over-muted-microphones",
    "slug": "trumpharrisagree",
    "body": "<p>United States Vice President Kamala Harris and former US President Donald Trump have settled on the ground rules for their first debate following a dispute over whether their microphones should be kept on throughout the event.</p><p>ABC News on Wednesday confirmed the format for the September 10 debate after the disagreement over microphones had threatened to derail the first – and, so far, only confirmed – face-off between the Democratic and Republican nominees.</p><p></p><p></p><p></p><p></p><p>ABC News said Trump would give the last closing statement and stand on the left of the screen after winning a virtual coin flip.</p><p>The 90-minute debate will be held at the National Constitution Center in Philadelphia and feature no audience.</p><p>The announcement came after the Harris campaign agreed that the microphones would be muted when it is the other candidate’s turn to speak.</p><p>Her campaign had pressed to keep the microphones on at all times, arguing she should have the opportunity to “deal with Trump’s constant lies and interruptions in real-time.”</p><p>In a letter to ABC News after agreeing to the rules, the Harris campaign said it would be “fundamentally disadvantaged by this format”, but it did not wish to “jeopardise the debate”.</p><p>Trump said last week he would “probably” keep the microphones on, but “the agreement was that it would be the same as it was last time”.</p><p>Before dropping his bid for re-election, US President Joe Biden had insisted on muted microphones to stop Trump from interrupting him while speaking.</p><p>Harris and Trump both agreed to a debate on September 10, but the event had been in question in recent weeks after the sides clashed over the microphone rules and the Republican candidate suggested that he might back out.</p><br><br><ul><li><a href='https://www.aljazeera.com/news/2024/9/5/trump-harris-agree-on-debate-rules-after-dispute-over-muted-microphones'>Visit Al Jazeera</a></li></ul>",
    "summary": "ABC News confirms ground rules for first presidential debate on September 10.",
    "author": "See article for details",
    "media": "https://www.aljazeera.com/wp-content/uploads/2024/09/AP24240585356512-1725504813.jpg?resize=770%2C513&quality=80",
    "date": "2024-09-05T04:00:00.000Z",
    "resource": "Al Jazeera",
    "id": "cm0ou5b120007ldt799uzcyvm"
  },
  {
    "headline": "US charges RT employees over alleged secret funding of right-wing media",
    "link": "https://www.aljazeera.com/news/2024/9/5/us-accuses-russias-rt-of-interference-in-2024-election",
    "slug": "uschargesrt",
    "body": "<p>The United States has announced a range of actions to combat Russian efforts to influence the 2024 presidential election, including the indictment of two state media employees accused of secretly funding a US media company to sow political divisions.</p><p>In an indictment unsealed on Wednesday, the US Justice Department alleged that two employees of Russia’s RT used shell companies and fake identities to pay $10m to a media outlet in Tennessee as part of a Moscow-directed influence operation.</p><p></p><p></p><p></p><p></p><p>Kostiantyn Kalashnikov and Elena Afanasyeva face charges of conspiracy to launder money and conspiracy to violate the Foreign Agents Registration Act.</p><p>US Attorney General Merrick B Garland said the influence campaign had targeted US audiences with “hidden Russian government messaging”.</p><p>“The company never disclosed to the influencers – or to their millions of followers – its ties to RT and the Russian government. Instead, the defendants and the company claimed that the company was sponsored by a private investor. That private investor was a fictitious persona,” Garland said.</p><p>Garland said authorities would not tolerate attempts by an “authoritarian regime to exploit our country’s free exchange of ideas in order to covertly further its own propaganda efforts”, and that investigations were ongoing.</p><p>While US officials did not identify the Tennessee-based outlet by name, the indictment says the company describes itself as a “network of heterodox commentators that focus on Western political and cultural issues”.</p><p>The description matches Tenet Media, a network of influencers known for their right-wing views that includes Dave Rubin, Tim Pool, Lauren Southern and Benny Johnson.</p><p>Tenet Media and RT did not immediately respond to requests for comment.</p><p>Rubin said the allegations “clearly show that I and other commentators were the victims of this scheme”.</p><p>“I knew absolutely nothing about any of this fraudulent activity,” he said in a post on X.</p><p>Johnson said he was “disturbed” by the allegations, which “make clear that myself and other influencers were victims in this alleged scheme”.</p><p>“My lawyers will handle anyone who states or suggests otherwise,” he said on X.</p><p>Pool said he had been deceived if the allegations were true.</p><p>“Never at any point did anyone other than I have full editorial control of the show and the contents of the show are often apolitical,” he said on X.</p><p>Separately, US officials said they had seized 32 internet domains used for Russian-led “malign influence campaigns” aimed at interfering in the US election and reducing international support for Ukraine.</p><p>“Companies operating at the direction of the Russian government created websites to trick Americans into unwittingly consuming Russian propaganda,” FBI director, Christopher Wray, said in a statement.</p><p>“By seizing these websites, the FBI is making clear to the world what they are, Russian attempts to interfere in our elections and influence our society.”</p><p>US officials have repeatedly accused foreign governments, including Moscow, of seeking to meddle in the country’s elections, including the presidential votes in 2016 and 2020.</p><p>Last month, US intelligence agencies accused Iran of conducting cyber attacks on the presidential campaigns of Democratic nominee Kamala Harris and Republican nominee Donald Trump.</p><p>In May, Director of National Intelligence Avril Haines named Russia, China and Iran as the most prolific “foreign actors” seeking to meddle in elections.</p><p>US prosecutors in 2018 charged 13 Russian citizens and entities with interfering in the 2016 election to benefit then-candidate Trump.</p><br><br><ul><li><a href='https://www.aljazeera.com/news/2024/9/5/us-accuses-russias-rt-of-interference-in-2024-election'>Visit Al Jazeera</a></li></ul>",
    "summary": "US Justice Department says two employees of Russia’s RT secretly paid $10m to Tennessee-based media outlet.",
    "author": "See article for details",
    "media": "https://www.aljazeera.com/wp-content/uploads/2024/09/AP24248643523899-1-1725501391.jpg?resize=770%2C513&quality=80",
    "date": "2024-09-05T04:00:00.000Z",
    "resource": "Al Jazeera",
    "id": "cm0ou5b9g0008ldt7eeuq9uz8"
  },
  {
    "headline": "Are Russia’s and NATO’s ‘red lines’ in Ukraine shifting?",
    "link": "https://www.aljazeera.com/program/inside-story/2024/9/4/are-russias-and-natos-red-lines-in-ukraine-shifting",
    "slug": "arerussiasand",
    "body": "<p>Moscow and NATO have so-called red lines that, if breached, could potentially trigger an outright war between them.</p><p>The conflict in Ukraine now involves many countries as Kyiv uses Western weapons in Russian territory.</p><p>So are these red lines shifting? And is there a greater risk of a wider war?</p><p>Presenter: Folly Bah Thibault</p><p>Guests:</p><p>Dmitry Babich – deputy foreign editor of the Komsomolskaya Pravda newspaper in Moscow</p><p>Peter Zalmayev – executive director of the Eurasia Democracy Initiative in Kyiv</p><p>Ben Aris – editor of bne IntelliNews in Berlin</p><br><br><ul><li><a href='https://www.aljazeera.com/program/inside-story/2024/9/4/are-russias-and-natos-red-lines-in-ukraine-shifting'>Visit Al Jazeera</a></li></ul>",
    "summary": ""
  }
]